googlecontacts-connector-test/src/test/resources/artifacts/ESB/config/requests/googlecontacts/esb_changeGroupMembership_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.googlecontacts">
   <soapenv:Header></soapenv:Header>
   <soapenv:Body>
		<urn:changeGroupMembership>
			<urn:appName>%s(appName)</urn:appName>
			<urn:userEmail>%s(userEmail)</urn:userEmail>
			<urn:accessToken>%s(accessToken)</urn:accessToken>
			<urn:contactId>%s(contactId)</urn:contactId>
			<urn:groupMembershipInfo deleted='false' href='http://www.google.com/m8/feeds/groups/%s(userEmail)/base/%s(groupId)'/> 
			<urn:method>changeGroupMembership</urn:method>
		</urn:changeGroupMembership>
    </soapenv:Body>
</soapenv:Envelope>
